<?php

// any_in_array() is not in the Array Helper, so it defines a new function
if (!function_exists("any_in_array")) {
    function any_in_array($needle, $haystack)
    {
        $needle = is_array($needle) ? $needle : [$needle];

        foreach ($needle as $item) {
            if (in_array($item, $haystack, true)) {
                return true;
            }
        }

        return false;
    }
}

// random_element() is included in Array Helper, so it overrides the native function
if (!function_exists("random_element")) {
    function random_element($array)
    {
        shuffle($array);

        return array_pop($array);
    }
}

// for converting given date into a time ago string 
if (!function_exists("get_timeago")) {
    function get_timeago($ptime)
    {
        $estimate_time = time() - $ptime;
        if ($estimate_time < 1) {
            return 'less than 1 second ago';
        }

        $condition = array(
            12 * 30 * 24 * 60 * 60  =>  'year',
            30 * 24 * 60 * 60       =>  'month',
            24 * 60 * 60            =>  'day',
            60 * 60                 =>  'hour',
            60                      =>  'minute',
            1                       =>  'second'
        );

        foreach ($condition as $secs => $str) {
            $d = $estimate_time / $secs;

            if ($d >= 1) {
                $r = round($d);
                return $r . ' ' . $str . ($r > 1 ? 's' : '') . ' ago';
            }
        }
    }

    // Function: used to convert a string to revese in order
    if (!function_exists("reverse_string")) {
        function reverse_string(string $string)
        {
            return strrev($string);
        }
    }
}

// Function: used to create slugs
if (!function_exists("slugify")) {
    function slugify($text)
    {
        // replace non letter or digits by -
        $text = preg_replace('~[^\pL\d]+~u', '-', $text);

        // transliterate
        $text = iconv('utf-8', 'us-ascii//TRANSLIT', $text);

        // remove unwanted characters
        $text = preg_replace('~[^-\w]+~', '', $text);

        // trim
        $text = trim($text, '-');

        // remove duplicate -
        $text = preg_replace('~-+~', '-', $text);

        // lowercase
        $text = strtolower($text);

        if (empty($text)) {
            return 'n-a';
        }

        return $text;
    }
}

if (!function_exists("gender_arr")) {
    function gender_arr()
    {
        $data = [];
        $data['ஆண்'] = 'ஆண்';
        $data['பெண்'] = 'பெண்';
        $data['மற்றவை'] = 'மற்றவை';

        return $data;
    }
}

if (!function_exists("height_arr")) {
    function height_arr()
    {
        $data = [];
        $data['4'] = 4;
        $data['4.1'] = 4.1;
        $data['4.2'] = 4.2;
        $data['4.3'] = 4.3;
        $data['4.4'] = 4.4;
        $data['4.5'] = 4.5;
        $data['4.6'] = 4.6;
        $data['4.7'] = 4.7;
        $data['4.8'] = 4.8;
        $data['4.9'] = 4.9;
        $data['4.10'] = 4.10;
        $data['4.11'] = 4.11;
        $data['5'] = 5;
        $data['5.1'] = 5.1;
        $data['5.2'] = 5.2;
        $data['5.3'] = 5.3;
        $data['5.4'] = 5.4;
        $data['5.5'] = 5.5;
        $data['5.6'] = 5.6;
        $data['5.7'] = 5.7;
        $data['5.8'] = 5.8;
        $data['5.9'] = 5.9;
        $data['5.10'] = 5.10;
        $data['5.11'] = 5.11;
        $data['6'] = 6;
        $data['6.1'] = 6.1;
        $data['6.2'] = 6.2;
        $data['6.3'] = 6.3;
        $data['6.4'] = 6.4;
        $data['6.5'] = 6.5;
        $data['6.6'] = 6.6;
        $data['6.7'] = 6.7;
        $data['6.8'] = 6.8;
        $data['6.9'] = 6.9;
        $data['6.10'] = 6.10;
        $data['6.11'] = 6.11;

        return $data;
    }
}

if (!function_exists("color_arr")) {
    function color_arr()
    {
        $data = [];
        $data['சிவப்பு'] = 'சிவப்பு';
        $data['மாநிறம்'] = 'மாநிறம்';
        $data['கருப்பு'] = 'கருப்பு';
        $data['வெள்ளை'] = 'வெள்ளை';

        return $data;
    }
}


if (!function_exists("caste_arr")) {
    function caste_arr()
    {
        $caste = [];

        $caste["அகமுடையார்"] = 'அகமுடையார்';
        $caste["அம்பலக்காரர்"] = 'அம்பலக்காரர்';
        $caste["அருந்ததியர்"] = 'அருந்ததியர்';
        $caste["ஆண்டி பண்டாரம்"] = 'ஆண்டி பண்டாரம்';
        $caste["ஆதிதிராவிடர்"] = 'ஆதிதிராவிடர்';
        $caste["ஆறுநாட்டு வேளாளர்"] = 'ஆறுநாட்டு வேளாளர்';
        $caste["ஆள்வார்"] = 'ஆள்வார்';
        $caste["இசை வெள்ளாளர்"] = 'இசை வெள்ளாளர்';
        $caste["இந்து கோணார்"] = 'இந்து கோணார்';
        $caste["இருளர்"] = 'இருளர்';
        $caste["இல்லத்து பிள்ளை"] = 'இல்லத்து பிள்ளை';
        $caste["எழவர்"] = 'எழவர்';
        $caste["ஒக்கலிக கவுண்டர்"] = 'ஒக்கலிக கவுண்டர்';
        $caste["கம்மவார் நாயுடு"] = 'கம்மவார் நாயுடு';
        $caste["கருணீகர்"] = 'கருணீகர்';
        $caste["கள்ளர்"] = 'கள்ளர்';
        $caste["கவரா நாயுடு"] = 'கவரா நாயுடு';
        $caste["கவுண்டர்"] = 'கவுண்டர்';
        $caste["கவுண்டர்-குரும்பா"] = 'கவுண்டர்-குரும்பா';
        $caste["கவுண்டர்-கொங்கு வெள்ளாளர்"] = 'கவுண்டர்-கொங்கு வெள்ளாளர்';
        $caste["காரைக்கட்டு பிள்ளை"] = 'காரைக்கட்டு பிள்ளை';
        $caste["கார்கார்த்த வேளாளர் சைவம்"] = 'கார்கார்த்த வேளாளர் சைவம்';
        $caste["கிராமினி"] = 'கிராமினி';
        $caste["கிருஸ்துவ - படையாட்சி"] = 'கிருஸ்துவ - படையாட்சி';
        $caste["கிறிஸ்டியன்-RC"] = 'கிறிஸ்டியன்-RC';
        $caste["கிறிஸ்துவர்"] = 'கிறிஸ்துவர்';
        $caste["குறவர்"] = 'குறவர்';
        $caste["குலலார்"] = 'குலலார்';
        $caste["கொடிக்கால் பிள்ளை"] = 'கொடிக்கால் பிள்ளை';
        $caste["சாதி இல்லை"] = 'சாதி இல்லை';
        $caste["சாத்தாத ஸ்ரீ வைஷ்ணவா"] = 'சாத்தாத ஸ்ரீ வைஷ்ணவா';
        $caste["சாலியர்"] = 'சாலியர்';
        $caste["செட்டியார்"] = 'செட்டியார்';
        $caste["செட்டியார்-அச்சிரபாக்கம்"] = 'செட்டியார்-அச்சிரபாக்கம்';
        $caste["செட்டியார்-ஆயிர வைசியர்"] = 'செட்டியார்-ஆயிர வைசியர்';
        $caste["செட்டியார்-ஆர்ய வைசியர்"] = 'செட்டியார்-ஆர்ய வைசியர்';
        $caste["செட்டியார்-கன்னட தேவாங்கர்"] = 'செட்டியார்-கன்னட தேவாங்கர்';
        $caste["செட்டியார்-கன்னடியர்"] = 'செட்டியார்-கன்னடியர்';
        $caste["செட்டியார்-காசுக்காரர்"] = 'செட்டியார்-காசுக்காரர்';
        $caste["செட்டியார்-கொங்கு"] = 'செட்டியார்-கொங்கு';
        $caste["செட்டியார்-சமயபுரம்"] = 'செட்டியார்-சமயபுரம்';
        $caste["செட்டியார்-சைவம்"] = 'செட்டியார்-சைவம்';
        $caste["செட்டியார்-சோழியர்"] = 'செட்டியார்-சோழியர்';
        $caste["செட்டியார்-தெலுங்கு"] = 'செட்டியார்-தெலுங்கு';
        $caste["செட்டியார்-தெலுங்கு தேவாங்கர்"] = 'செட்டியார்-தெலுங்கு தேவாங்கர்';
        $caste["செட்டியார்-தேவாங்கர்"] = 'செட்டியார்-தேவாங்கர்';
        $caste["செட்டியார்-நகரம்"] = 'செட்டியார்-நகரம்';
        $caste["செட்டியார்-நடுமண்டலம்"] = 'செட்டியார்-நடுமண்டலம்';
        $caste["செட்டியார்-நாட்டுகோட்டை"] = 'செட்டியார்-நாட்டுகோட்டை';
        $caste["செட்டியார்-பத்மசாலியர்"] = 'செட்டியார்-பத்மசாலியர்';
        $caste["செட்டியார்-பேரி"] = 'செட்டியார்-பேரி';
        $caste["செட்டியார்-மஞ்சப்புத்தூர்"] = 'செட்டியார்-மஞ்சப்புத்தூர்';
        $caste["செட்டியார்-வடம்பர்"] = 'செட்டியார்-வடம்பர்';
        $caste["செட்டியார்-வாணியர்"] = 'செட்டியார்-வாணியர்';
        $caste["செட்டியார்-வெள்ளான்"] = 'செட்டியார்-வெள்ளான்';
        $caste["சேனை தலைவர்"] = 'சேனை தலைவர்';
        $caste["சைவ பிள்ளை"] = 'சைவ பிள்ளை';
        $caste["சோழிய வெள்ளாளர்"] = 'சோழிய வெள்ளாளர்';
        $caste["சௌராஷ்டிரா"] = 'சௌராஷ்டிரா';
        $caste["துளுவ வெள்ளாளர்"] = 'துளுவ வெள்ளாளர்';
        $caste["தேசிகர்"] = 'தேசிகர்';
        $caste["தேவர்"] = 'தேவர்';
        $caste["தேவேந்திரகுலம்"] = 'தேவேந்திரகுலம்';
        $caste["நத்தமான் உடையார்"] = 'நத்தமான் உடையார்';
        $caste["நாஞ்சில் வெள்ளாளர்"] = 'நாஞ்சில் வெள்ளாளர்';
        $caste["நாடார்"] = 'நாடார்';
        $caste["நாயக்கர்"] = 'நாயக்கர்';
        $caste["நாயர்"] = 'நாயர்';
        $caste["நாயுடு"] = 'நாயுடு';
        $caste["படையாட்சி"] = 'படையாட்சி';
        $caste["பர்வத ராஜகுலம்"] = 'பர்வத ராஜகுலம்';
        $caste["பலிஜா நாயுடு"] = 'பலிஜா நாயுடு';
        $caste["பாண்டிய வெள்ளாளர்"] = 'பாண்டிய வெள்ளாளர்';
        $caste["பார்க்கவகுலம்"] = 'பார்க்கவகுலம்';
        $caste["பார்க்குவல மலையமான் உடையார்"] = 'பார்க்குவல மலையமான் உடையார்';
        $caste["பிராமின்-ஐயங்கார்"] = 'பிராமின்-ஐயங்கார்';
        $caste["பிராமின்-ஐயர்"] = 'பிராமின்-ஐயர்';
        $caste["பிராமின்-கன்னட மாத்வா"] = 'பிராமின்-கன்னட மாத்வா';
        $caste["பிராமின்-குருக்கள்"] = 'பிராமின்-குருக்கள்';
        $caste["பிராமின்-தெலுங்கு"] = 'பிராமின்-தெலுங்கு';
        $caste["பிள்ளை"] = 'பிள்ளை';
        $caste["போயர்"] = 'போயர்';
        $caste["மருத்துவர்"] = 'மருத்துவர்';
        $caste["மறவர்"] = 'மறவர்';
        $caste["மற்றவை"] = 'மற்றவை';
        $caste["முதலியார்"] = 'முதலியார்';
        $caste["முதலியார்-அகமுடையார்"] = 'முதலியார்-அகமுடையார்';
        $caste["முதலியார்-ஆற்காடு"] = 'முதலியார்-ஆற்காடு';
        $caste["முதலியார்-செங்குந்தர்"] = 'முதலியார்-செங்குந்தர்';
        $caste["முதலியார்-சைவம்"] = 'முதலியார்-சைவம்';
        $caste["முதலியார்-துளுவ வேளாளர்"] = 'முதலியார்-துளுவ வேளாளர்';
        $caste["முதலியார்-பூவிருந்தவல்லி"] = 'முதலியார்-பூவிருந்தவல்லி';
        $caste["முத்துராஜா"] = 'முத்துராஜா';
        $caste["யாதவர்-தமிழ்"] = 'யாதவர்-தமிழ்';
        $caste["யாதவர்-தெலுங்கு"] = 'யாதவர்-தெலுங்கு';
        $caste["ராஜுக்கள்"] = 'ராஜுக்கள்';
        $caste["ரெட்டியார்"] = 'ரெட்டியார்';
        $caste["ரெட்டியார்"] = 'ரெட்டியார்';
        $caste["வண்ணார்"] = 'வண்ணார்';
        $caste["வன்னிய குல சத்ரியர்"] = 'வன்னிய குல சத்ரியர்';
        $caste["வன்னியர்"] = 'வன்னியர்';
        
        $caste["வல்லம்பர்"] = 'வல்லம்பர்';
        $caste["வள்ளுவர்"] = 'வள்ளுவர்';
        $caste["வாண்டையார்"] = 'வாண்டையார்';
        $caste["விஸ்வகர்மா-கம்மாளர்"] = 'விஸ்வகர்மா-கம்மாளர்';
        $caste["விஸ்வகர்மா-சைவம்"] = 'விஸ்வகர்மா-சைவம்';
        $caste["விஸ்வகர்மா-தமிழ்"] = 'விஸ்வகர்மா-தமிழ்';
        $caste["விஸ்வகர்மா-தெலுங்கு"] = 'விஸ்வகர்மா-தெலுங்கு';
        $caste["விஸ்வகர்மா-பத்தர்"] = 'விஸ்வகர்மா-பத்தர்';
        $caste["விஸ்வகர்மா-மலையாளம்"] = 'விஸ்வகர்மா-மலையாளம்';
        $caste["வீர சைவம்"] = 'வீர சைவம்';
        $caste["வீரக்குடி வெள்ளாளர்"] = 'வீரக்குடி வெள்ளாளர்';
        $caste["வெள்ளாளர்"] = 'வெள்ளாளர்';
        $caste["வேளார்"] = 'வேளார்';
        $caste["வேளாளர்"] = 'வேளாளர்';

        return $caste;
    }
}

if (!function_exists("caste_expect_arr")) {
    function caste_expect_arr()
    {
        $caste = [];

        $caste["சாதி வரம்பு இல்லை"] = 'சாதி வரம்பு இல்லை';
        $caste["சாதி வரம்பு இல்லை (SC ST தவிர)"] = 'சாதி வரம்பு இல்லை (SC ST தவிர)';
        $caste["அகமுடையார்"] = 'அகமுடையார்';
        $caste["அம்பலக்காரர்"] = 'அம்பலக்காரர்';
        $caste["அருந்ததியர்"] = 'அருந்ததியர்';
        $caste["ஆண்டி பண்டாரம்"] = 'ஆண்டி பண்டாரம்';
        $caste["ஆதிதிராவிடர்"] = 'ஆதிதிராவிடர்';
        $caste["ஆறுநாட்டு வேளாளர்"] = 'ஆறுநாட்டு வேளாளர்';
        $caste["ஆள்வார்"] = 'ஆள்வார்';
        $caste["இசை வெள்ளாளர்"] = 'இசை வெள்ளாளர்';
        $caste["இந்து கோணார்"] = 'இந்து கோணார்';
        $caste["இருளர்"] = 'இருளர்';
        $caste["இல்லத்து பிள்ளை"] = 'இல்லத்து பிள்ளை';
        $caste["எழவர்"] = 'எழவர்';
        $caste["ஒக்கலிக கவுண்டர்"] = 'ஒக்கலிக கவுண்டர்';
        $caste["கம்மவார் நாயுடு"] = 'கம்மவார் நாயுடு';
        $caste["கருணீகர்"] = 'கருணீகர்';
        $caste["கள்ளர்"] = 'கள்ளர்';
        $caste["கவரா நாயுடு"] = 'கவரா நாயுடு';
        $caste["கவுண்டர்"] = 'கவுண்டர்';
        $caste["கவுண்டர்-குரும்பா"] = 'கவுண்டர்-குரும்பா';
        $caste["கவுண்டர்-கொங்கு வெள்ளாளர்"] = 'கவுண்டர்-கொங்கு வெள்ளாளர்';
        $caste["காரைக்கட்டு பிள்ளை"] = 'காரைக்கட்டு பிள்ளை';
        $caste["கார்கார்த்த வேளாளர் சைவம்"] = 'கார்கார்த்த வேளாளர் சைவம்';
        $caste["கிராமினி"] = 'கிராமினி';
        $caste["கிருஸ்துவ - படையாட்சி"] = 'கிருஸ்துவ - படையாட்சி';
        $caste["கிறிஸ்டியன்-RC"] = 'கிறிஸ்டியன்-RC';
        $caste["கிறிஸ்துவர்"] = 'கிறிஸ்துவர்';
        $caste["குறவர்"] = 'குறவர்';
        $caste["குலலார்"] = 'குலலார்';
        $caste["கொடிக்கால் பிள்ளை"] = 'கொடிக்கால் பிள்ளை';
        $caste["சாதி இல்லை"] = 'சாதி இல்லை';
        $caste["சாத்தாத ஸ்ரீ வைஷ்ணவா"] = 'சாத்தாத ஸ்ரீ வைஷ்ணவா';
        $caste["சாலியர்"] = 'சாலியர்';
        $caste["செட்டியார்"] = 'செட்டியார்';
        $caste["செட்டியார்-அச்சிரபாக்கம்"] = 'செட்டியார்-அச்சிரபாக்கம்';
        $caste["செட்டியார்-ஆயிர வைசியர்"] = 'செட்டியார்-ஆயிர வைசியர்';
        $caste["செட்டியார்-ஆர்ய வைசியர்"] = 'செட்டியார்-ஆர்ய வைசியர்';
        $caste["செட்டியார்-கன்னட தேவாங்கர்"] = 'செட்டியார்-கன்னட தேவாங்கர்';
        $caste["செட்டியார்-கன்னடியர்"] = 'செட்டியார்-கன்னடியர்';
        $caste["செட்டியார்-காசுக்காரர்"] = 'செட்டியார்-காசுக்காரர்';
        $caste["செட்டியார்-கொங்கு"] = 'செட்டியார்-கொங்கு';
        $caste["செட்டியார்-சமயபுரம்"] = 'செட்டியார்-சமயபுரம்';
        $caste["செட்டியார்-சைவம்"] = 'செட்டியார்-சைவம்';
        $caste["செட்டியார்-சோழியர்"] = 'செட்டியார்-சோழியர்';
        $caste["செட்டியார்-தெலுங்கு"] = 'செட்டியார்-தெலுங்கு';
        $caste["செட்டியார்-தெலுங்கு தேவாங்கர்"] = 'செட்டியார்-தெலுங்கு தேவாங்கர்';
        $caste["செட்டியார்-தேவாங்கர்"] = 'செட்டியார்-தேவாங்கர்';
        $caste["செட்டியார்-நகரம்"] = 'செட்டியார்-நகரம்';
        $caste["செட்டியார்-நடுமண்டலம்"] = 'செட்டியார்-நடுமண்டலம்';
        $caste["செட்டியார்-நாட்டுகோட்டை"] = 'செட்டியார்-நாட்டுகோட்டை';
        $caste["செட்டியார்-பத்மசாலியர்"] = 'செட்டியார்-பத்மசாலியர்';
        $caste["செட்டியார்-பேரி"] = 'செட்டியார்-பேரி';
        $caste["செட்டியார்-மஞ்சப்புத்தூர்"] = 'செட்டியார்-மஞ்சப்புத்தூர்';
        $caste["செட்டியார்-வடம்பர்"] = 'செட்டியார்-வடம்பர்';
        $caste["செட்டியார்-வாணியர்"] = 'செட்டியார்-வாணியர்';
        $caste["செட்டியார்-வெள்ளான்"] = 'செட்டியார்-வெள்ளான்';
        $caste["சேனை தலைவர்"] = 'சேனை தலைவர்';
        $caste["சைவ பிள்ளை"] = 'சைவ பிள்ளை';
        $caste["சோழிய வெள்ளாளர்"] = 'சோழிய வெள்ளாளர்';
        $caste["சௌராஷ்டிரா"] = 'சௌராஷ்டிரா';
        $caste["துளுவ வெள்ளாளர்"] = 'துளுவ வெள்ளாளர்';
        $caste["தேசிகர்"] = 'தேசிகர்';
        $caste["தேவர்"] = 'தேவர்';
        $caste["தேவேந்திரகுலம்"] = 'தேவேந்திரகுலம்';
        $caste["நத்தமான் உடையார்"] = 'நத்தமான் உடையார்';
        $caste["நாஞ்சில் வெள்ளாளர்"] = 'நாஞ்சில் வெள்ளாளர்';
        $caste["நாடார்"] = 'நாடார்';
        $caste["நாயக்கர்"] = 'நாயக்கர்';
        $caste["நாயர்"] = 'நாயர்';
        $caste["நாயுடு"] = 'நாயுடு';
        $caste["படையாட்சி"] = 'படையாட்சி';
        $caste["பர்வத ராஜகுலம்"] = 'பர்வத ராஜகுலம்';
        $caste["பலிஜா நாயுடு"] = 'பலிஜா நாயுடு';
        $caste["பாண்டிய வெள்ளாளர்"] = 'பாண்டிய வெள்ளாளர்';
        $caste["பார்க்கவகுலம்"] = 'பார்க்கவகுலம்';
        $caste["பார்க்குவல மலையமான் உடையார்"] = 'பார்க்குவல மலையமான் உடையார்';
        $caste["பிராமின்-ஐயங்கார்"] = 'பிராமின்-ஐயங்கார்';
        $caste["பிராமின்-ஐயர்"] = 'பிராமின்-ஐயர்';
        $caste["பிராமின்-கன்னட மாத்வா"] = 'பிராமின்-கன்னட மாத்வா';
        $caste["பிராமின்-குருக்கள்"] = 'பிராமின்-குருக்கள்';
        $caste["பிராமின்-தெலுங்கு"] = 'பிராமின்-தெலுங்கு';
        $caste["பிள்ளை"] = 'பிள்ளை';
        $caste["போயர்"] = 'போயர்';
        $caste["மருத்துவர்"] = 'மருத்துவர்';
        $caste["மறவர்"] = 'மறவர்';
        $caste["மற்றவை"] = 'மற்றவை';
        $caste["முதலியார்"] = 'முதலியார்';
        $caste["முதலியார்-அகமுடையார்"] = 'முதலியார்-அகமுடையார்';
        $caste["முதலியார்-ஆற்காடு"] = 'முதலியார்-ஆற்காடு';
        $caste["முதலியார்-செங்குந்தர்"] = 'முதலியார்-செங்குந்தர்';
        $caste["முதலியார்-சைவம்"] = 'முதலியார்-சைவம்';
        $caste["முதலியார்-துளுவ வேளாளர்"] = 'முதலியார்-துளுவ வேளாளர்';
        $caste["முதலியார்-பூவிருந்தவல்லி"] = 'முதலியார்-பூவிருந்தவல்லி';
        $caste["முத்துராஜா"] = 'முத்துராஜா';
        $caste["யாதவர்-தமிழ்"] = 'யாதவர்-தமிழ்';
        $caste["யாதவர்-தெலுங்கு"] = 'யாதவர்-தெலுங்கு';
        $caste["ராஜுக்கள்"] = 'ராஜுக்கள்';
        $caste["ரெட்டியார்"] = 'ரெட்டியார்';
        $caste["ரெட்டியார்"] = 'ரெட்டியார்';
        $caste["வண்ணார்"] = 'வண்ணார்';
        $caste["வன்னிய குல சத்ரியர்"] = 'வன்னிய குல சத்ரியர்';
        $caste["வன்னியர்"] = 'வன்னியர்';
       
        $caste["வல்லம்பர்"] = 'வல்லம்பர்';
        $caste["வள்ளுவர்"] = 'வள்ளுவர்';
        $caste["வாண்டையார்"] = 'வாண்டையார்';
        $caste["விஸ்வகர்மா-கம்மாளர்"] = 'விஸ்வகர்மா-கம்மாளர்';
        $caste["விஸ்வகர்மா-சைவம்"] = 'விஸ்வகர்மா-சைவம்';
        $caste["விஸ்வகர்மா-தமிழ்"] = 'விஸ்வகர்மா-தமிழ்';
        $caste["விஸ்வகர்மா-தெலுங்கு"] = 'விஸ்வகர்மா-தெலுங்கு';
        $caste["விஸ்வகர்மா-பத்தர்"] = 'விஸ்வகர்மா-பத்தர்';
        $caste["விஸ்வகர்மா-மலையாளம்"] = 'விஸ்வகர்மா-மலையாளம்';
        $caste["வீர சைவம்"] = 'வீர சைவம்';
        $caste["வீரக்குடி வெள்ளாளர்"] = 'வீரக்குடி வெள்ளாளர்';
        $caste["வெள்ளாளர்"] = 'வெள்ளாளர்';
        $caste["வேளார்"] = 'வேளார்';
        $caste["வேளாளர்"] = 'வேளாளர்';

        return $caste;
    }
}

if (!function_exists("sibiling_arr")) {
    function sibiling_arr()
    {
        $data = [];
        $data['0'] = 0;
        $data['1'] = 1;
        $data['2'] = 2;
        $data['3'] = 3;
        $data['4'] = 4;
        $data['5'] = 5;
        $data['6'] = 6;
        $data['7'] = 7;
        $data['8'] = 8;
        $data['9'] = 9;

        return $data;
    }
}

if (!function_exists("city_arr")) {
    function city_arr()
    {

        $data['அரக்கோணம்'] = 'அரக்கோணம்';
        $data['அரந்தாங்கி'] = 'அரந்தாங்கி';
        $data['அரியலூர்'] = 'அரியலூர்';
        $data['ஆத்தூர்'] = 'ஆத்தூர்';
        $data['ஆரணி'] = 'ஆரணி';
        $data['ஆற்காடு'] = 'ஆற்காடு';
        $data['இராமநாதபுரம்'] = 'இராமநாதபுரம்';
        $data['இராமேஸ்வரம்'] = 'இராமேஸ்வரம்';
        $data['ஈரோடு'] = 'ஈரோடு';
        $data['உடுமலைபேட்டை'] = 'உடுமலைபேட்டை';
        $data['ஒக்கனேக்கல்'] = 'ஒக்கனேக்கல்';
        $data['ஓசூர்'] = 'ஓசூர்';
        $data['கடலூர்'] = 'கடலூர்';
        $data['கன்னியாகுமரி'] = 'கன்னியாகுமரி';
        $data['கரூர்'] = 'கரூர்';
        $data['கல்பாக்கம்'] = 'கல்பாக்கம்';
        $data['கள்ளக்குறிச்சி'] = 'கள்ளக்குறிச்சி';
        $data['காங்கேயம்'] = 'காங்கேயம்';
        $data['காஞ்சிபுரம்'] = 'காஞ்சிபுரம்';
        $data['காரைக்கால்'] = 'காரைக்கால்';
        $data['காரைக்குடி'] = 'காரைக்குடி';
        $data['காளையார் கோவில்'] = 'காளையார் கோவில்';
        $data['கிருஷ்ணகிரி'] = 'கிருஷ்ணகிரி';
        $data['குடியாத்தம்'] = 'குடியாத்தம்';
        $data['குத்தாலம்'] = 'குத்தாலம்';
        $data['கும்பகோணம்'] = 'கும்பகோணம்';
        $data['கொடைக்கானல்'] = 'கொடைக்கானல்';
        $data['கோயம்புத்தூர்'] = 'கோயம்புத்தூர்';
        $data['கோவில்பட்டி'] = 'கோவில்பட்டி';
        $data['சிதம்பரம்'] = 'சிதம்பரம்';
        $data['சிவகங்கை'] = 'சிவகங்கை';
        $data['சிவகாசி'] = 'சிவகாசி';
        $data['சீர்காழி'] = 'சீர்காழி';
        $data['செங்கல்பட்டு'] = 'செங்கல்பட்டு';
        $data['சென்னை'] = 'சென்னை';
        $data['சேலம்'] = 'சேலம்';
        $data['ஜெயம்கொண்டம்'] = 'ஜெயம்கொண்டம்';
        $data['தஞ்சாவூர்'] = 'தஞ்சாவூர்';
        $data['தரங்கம்பாடி'] = 'தரங்கம்பாடி';
        $data['தர்மபுரி'] = 'தர்மபுரி';
        $data['தாராபுரம்'] = 'தாராபுரம்';
        $data['திண்டிவனம்'] = 'திண்டிவனம்';
        $data['திண்டுக்கல்'] = 'திண்டுக்கல்';
        $data['திருச்சிராப்பள்ளி'] = 'திருச்சிராப்பள்ளி';
        $data['திருச்செங்கோடு'] = 'திருச்செங்கோடு';
        $data['திருத்தணி'] = 'திருத்தணி';
        $data['திருத்துறைப்பூண்டி'] = 'திருத்துறைப்பூண்டி';
        $data['திருநள்ளாறு'] = 'திருநள்ளாறு';
        $data['திருநெல்வேலி'] = 'திருநெல்வேலி';
        $data['திருப்பத்தூர்'] = 'திருப்பத்தூர்';
        $data['திருப்பனந்தாள்'] = 'திருப்பனந்தாள்';
        $data['திருப்பூர்'] = 'திருப்பூர்';
        $data['திருவண்ணாமலை'] = 'திருவண்ணாமலை';
        $data['திருவாரூர்'] = 'திருவாரூர்';
        $data['திருவையாறு'] = 'திருவையாறு';
        $data['துறையூர்'] = 'துறையூர்';
        $data['தூத்துக்குடி'] = 'தூத்துக்குடி';
        $data['தென்காசி'] = 'தென்காசி';
        $data['தேனி'] = 'தேனி';
        $data['நன்னிலம்'] = 'நன்னிலம்';
        $data['நன்னிலம்'] = 'நன்னிலம்';
        $data['நாகப்பட்டினம்'] = 'நாகப்பட்டினம்';
        $data['நாகர்கோயில்'] = 'நாகர்கோயில்';
        $data['நாகூர்'] = 'நாகூர்';
        $data['நாமக்கல்'] = 'நாமக்கல்';
        $data['நீடாமங்கலம்'] = 'நீடாமங்கலம்';
        $data['நீலகிரி'] = 'நீலகிரி';
        $data['நெய்வேலி'] = 'நெய்வேலி';
        $data['பட்டுக்கோட்டை'] = 'பட்டுக்கோட்டை';
        $data['பந்தநல்லூர்'] = 'பந்தநல்லூர்';
        $data['பல்லடம்'] = 'பல்லடம்';
        $data['பழனி'] = 'பழனி';
        $data['பாபநாசம்'] = 'பாபநாசம்';
        $data['புதுக்கோட்டை'] = 'புதுக்கோட்டை';
        $data['புதுச்சேரி'] = 'புதுச்சேரி';
        $data['பூம்புகார்'] = 'பூம்புகார்';
        $data['பெரம்பலூர்'] = 'பெரம்பலூர்';
        $data['பேரளம்'] = 'பேரளம்';
        $data['பொறையார்'] = 'பொறையார்';
        $data['பொள்ளாச்சி'] = 'பொள்ளாச்சி';
        $data['மணப்பாறை'] = 'மணப்பாறை';
        $data['மதுரை'] = 'மதுரை';
        $data['மன்னார்குடி'] = 'மன்னார்குடி';
        $data['மயிலாடுதுறை'] = 'மயிலாடுதுறை';
        $data['மானாமதுரை'] = 'மானாமதுரை';
        $data['மேட்டூர்'] = 'மேட்டூர்';
        $data['ராஜபாளையம்'] = 'ராஜபாளையம்';
        $data['லால்குடி'] = 'லால்குடி';
        $data['வடமட்டம்'] = 'வடமட்டம்';
        $data['வலங்கைமான்'] = 'வலங்கைமான்';
        $data['விருதுநகர்'] = 'விருதுநகர்';
        $data['விருத்தாசலம்'] = 'விருத்தாசலம்';
        $data['விழுப்புரம்'] = 'விழுப்புரம்';
        $data['வேதாரண்யம்'] = 'வேதாரண்யம்';
        $data['வேலூர்'] = 'வேலூர்';
        $data['வேளாங்கண்ணி'] = 'வேளாங்கண்ணி';
        $data['ஸ்ரீரங்கம்'] = 'ஸ்ரீரங்கம்';
        $data['ஸ்ரீவில்லிபுத்துர்'] = 'ஸ்ரீவில்லிபுத்துர்';
       

        return $data;
    }
}

if (!function_exists("district_arr")) {
    function district_arr()
    {

        $data = [];
        $data['அரியலூர்'] = 'அரியலூர்';
        $data['ஈரோடு'] = 'ஈரோடு';
        $data['உதகமண்டலம்'] = 'உதகமண்டலம்';
        $data['கடலூர்'] = 'கடலூர்';
        $data['கன்னியாகுமரி'] = 'கன்னியாகுமரி';
        $data['கரூர்'] = 'கரூர்';
        $data['கள்ளக்குறிச்சி'] = 'கள்ளக்குறிச்சி';
        $data['காஞ்சிபுரம்'] = 'காஞ்சிபுரம்';
        $data['காரைக்கால்'] = 'காரைக்கால்';
        $data['கிருஷ்ணகிரி'] = 'கிருஷ்ணகிரி';
        $data['கோயம்புத்தூர்'] = 'கோயம்புத்தூர்';
        $data['சிவகங்கை'] = 'சிவகங்கை';
        $data['செங்கல்பட்டு'] = 'செங்கல்பட்டு';
        $data['சென்னை'] = 'சென்னை';
        $data['சேலம்'] = 'சேலம்';
        $data['தஞ்சாவூர்'] = 'தஞ்சாவூர்';
        $data['தர்மபுரி'] = 'தர்மபுரி';
        $data['திண்டுக்கல்'] = 'திண்டுக்கல்';
        $data['திருச்சி'] = 'திருச்சி';
        $data['திருநள்ளாறு'] = 'திருநள்ளாறு';
        $data['திருநெல்வேலி'] = 'திருநெல்வேலி';
        $data['திருப்பத்தூர்'] = 'திருப்பத்தூர்';
        $data['திருப்பூர்'] = 'திருப்பூர்';
        $data['திருவண்ணாமலை'] = 'திருவண்ணாமலை';
        $data['திருவள்ளூர்'] = 'திருவள்ளூர்';
        $data['திருவாரூர்'] = 'திருவாரூர்';
        $data['தூத்துக்குடி'] = 'தூத்துக்குடி';
        $data['தென்காசி'] = 'தென்காசி';
        $data['தேனி'] = 'தேனி';
        $data['நாகப்பட்டினம்'] = 'நாகப்பட்டினம்';
        $data['நாகர்கோயில்'] = 'நாகர்கோயில்';
        $data['நாமக்கல்'] = 'நாமக்கல்';
        $data['புதுக்கோட்டை'] = 'புதுக்கோட்டை';
        $data['புதுச்சேரி'] = 'புதுச்சேரி';
        $data['பெரம்பலூர்'] = 'பெரம்பலூர்';
        $data['மதுரை'] = 'மதுரை';
        $data['மயிலாடுதுறை'] = 'மயிலாடுதுறை';
        $data['ராணிப்பேட்டை'] = 'ராணிப்பேட்டை';
        $data['ராமநாதபுரம்'] = 'ராமநாதபுரம்';
        $data['விருதுநகர்'] = 'விருதுநகர்';
        $data['விழுப்புரம்'] = 'விழுப்புரம்';
        $data['வேலூர்'] = 'வேலூர்';
        

        return $data;
    }
}

if (!function_exists("marital_status_arr")) {
    function marital_status_arr()
    {
        
        $data = [];
        $data['திருமணம் ஆகாதவர்'] = 'திருமணம் ஆகாதவர்';
        $data['விவாகரத்து ஆனவர்'] = 'விவாகரத்து ஆனவர்';
        $data['துணையை இழந்தவர்'] = 'துணையை இழந்தவர்';
        $data['பிரிந்து வாழ்பவர்'] = 'பிரிந்து வாழ்பவர்';

        return $data;
    }
}

if (!function_exists("dhosam_arr")) {
    function dhosam_arr()
    {
        $data = [];
        $data['இல்லை'] = 'இல்லை';
        $data['தெரியவில்லை'] = 'தெரியவில்லை';
        $data['ராகு - கேது'] = 'ராகு - கேது';
        $data['செவ்வாய்'] = 'செவ்வாய்';
        $data['ராகு - கேது மற்றும் செவ்வாய்'] = 'ராகு - கேது மற்றும் செவ்வாய்';
        $data['சர்ப்ப தோஷம்'] = 'சர்ப்ப தோஷம்';

        return $data;
    }
}

if (!function_exists("zodiac_arr")) {
    function zodiac_arr()
    {
        $data = [];
        $data['ராசி/அம்சம்']['ல'] = 'இலக்கினம்';
        $data['ராசி/அம்சம்']['கேது'] ='கேது';
        $data['ராசி/அம்சம்']['சுக்'] = ' சுக்கிரன்';
        $data['ராசி/அம்சம்']['சூரி'] = ' சூரியன்';
        $data['ராசி/அம்சம்']['சந்'] = 'சந்திரன்';
        $data['ராசி/அம்சம்']['செவ்'] = 'செவ்வாய்';
        $data['ராசி/அம்சம்']['ராகு'] = 'ராகு';
        $data['ராசி/அம்சம்']['குரு'] = 'குரு';
        $data['ராசி/அம்சம்']['சனி'] = ' சனி';
        $data['ராசி/அம்சம்']['புதன்'] = 'புதன்';
        
        $data['தமிழ் வருடம்']['அட்சய'] = 'அட்சய';
        $data['தமிழ் வருடம்']['ஆங்கிரச'] = 'ஆங்கிரச';
        $data['தமிழ் வருடம்']['ஆனந்த'] = 'ஆனந்த';
        $data['தமிழ் வருடம்']['ஈஸ்வர'] = 'ஈஸ்வர';
        $data['தமிழ் வருடம்']['காளயுக்தி'] = 'காளயுக்தி';
        $data['தமிழ் வருடம்']['குரோதன'] = 'குரோதன';
        $data['தமிழ் வருடம்']['சாதாரண'] = 'சாதாரண';
        $data['தமிழ் வருடம்']['சித்தார்த்தி'] = 'சித்தார்த்தி';
        $data['தமிழ் வருடம்']['சித்ரபானு'] = 'சித்ரபானு';
        $data['தமிழ் வருடம்']['சுக்ல'] = 'சுக்ல';
        $data['தமிழ் வருடம்']['சுபானு'] = 'சுபானு';
        $data['தமிழ் வருடம்']['தாது'] = 'தாது';
        $data['தமிழ் வருடம்']['தாரண'] = 'தாரண';
        $data['தமிழ் வருடம்']['துந்துபி'] = 'துந்துபி';
        $data['தமிழ் வருடம்']['துன்மதி'] = 'துன்மதி';
        $data['தமிழ் வருடம்']['நள'] = 'நள';
        $data['தமிழ் வருடம்']['பகுதான்ய'] = 'பகுதான்ய';
        $data['தமிழ் வருடம்']['பரிதாபி'] = 'பரிதாபி';
        $data['தமிழ் வருடம்']['பவ'] = 'பவ';
        $data['தமிழ் வருடம்']['பார்த்திப'] = 'பார்த்திப';
        $data['தமிழ் வருடம்']['பிங்கள'] = 'பிங்கள';
        $data['தமிழ் வருடம்']['பிரஜோத்பத்தி'] = 'பிரஜோத்பத்தி';
        $data['தமிழ் வருடம்']['பிரபவ'] = 'பிரபவ';
        $data['தமிழ் வருடம்']['பிரமாதி'] = 'பிரமாதி';
        $data['தமிழ் வருடம்']['பிரமாதீச'] = 'பிரமாதீச';
        $data['தமிழ் வருடம்']['பிரமோதூத'] = 'பிரமோதூத';
        $data['தமிழ் வருடம்']['யுவ'] = 'யுவ';
        $data['தமிழ் வருடம்']['ரக்தாட்சி'] = 'ரக்தாட்சி';
        $data['தமிழ் வருடம்']['ராட்சச'] = 'ராட்சச';
        $data['தமிழ் வருடம்']['ருத்ரோத்காரி'] = 'ருத்ரோத்காரி';
        $data['தமிழ் வருடம்']['ரௌத்திரி'] = 'ரௌத்திரி';
        $data['தமிழ் வருடம்']['விக்ரம'] = 'விக்ரம';
        $data['தமிழ் வருடம்']['விபவ'] = 'விபவ';
        $data['தமிழ் வருடம்']['விரோதகிருது'] = 'விரோதகிருது';
        $data['தமிழ் வருடம்']['விஷு'] = 'விஷு';
        $data['தமிழ் வருடம்']['ஸ்ரீமுக'] = 'ஸ்ரீமுக';

        $data['மற்றவைகள்']['வியாழன்'] = 'வியாழன்';
        $data['மற்றவைகள்']['குஜன்'] = 'குஜன்';
        $data['மற்றவைகள்']['சனி(வ)'] = 'சனி (வ)';
        $data['மற்றவைகள்']['குரு(அஸ்)'] = 'குரு (அஸ்)';
        $data['மற்றவைகள்']['புதன்(அ)'] = 'புதன் (அ)';
        $data['மற்றவைகள்']['மாந்'] = 'மாந்';
        
        return $data;
    }
}

if (!function_exists("tamil_month_arr")) {
    function tamil_month_arr()
    {
        $data = [];

        $data['சித்திரை'] = 'சித்திரை';
        $data['வைகாசி'] = 'வைகாசி';
        $data['ஆனி'] = 'ஆனி';
        $data['ஆடி'] = 'ஆடி';
        $data['ஆவணி'] = 'ஆவணி';
        $data['புரட்டாசி'] = 'புரட்டாசி';
        $data['ஐப்பசி'] = 'ஐப்பசி';
        $data['கார்த்திகை'] = 'கார்த்திகை';
        $data['மார்கழி'] = 'மார்கழி';
        $data['தை'] = 'தை';
        $data['மாசி'] = 'மாசி';
        $data['பங்குனி'] = 'பங்குனி';

        return $data;
    }
}

if (!function_exists("tamil_days_arr")) {
    function tamil_days_arr()
    {
        $data = [];

        $data['ஞாயிறு'] = 'ஞாயிறு';
        $data['திங்கள்'] = 'திங்கள்';
        $data['செவ்வாய்'] = 'செவ்வாய்';
        $data['புதன்'] = 'புதன்';
        $data['வியாழன்'] = 'வியாழன்';
        $data['வெள்ளி'] = 'வெள்ளி';
        $data['சனி'] = 'சனி';

        return $data;
    }
}

if (!function_exists("tamil_period_arr")) {
    function tamil_period_arr()
    {
        $data = [];

        $data['காலை'] = 'காலை';
        $data['மாலை'] = 'மாலை';
        $data['பகல்'] = 'பகல்';
        $data['இரவு'] = 'இரவு';

        return $data;
    }
}

if (!function_exists("stars_arr")) {
    function stars_arr()
    {
        $data = [];

        $data['அஸ்வினி'] = 'அஸ்வினி';
        $data['பரணி'] = 'பரணி';
        $data['கார்த்திகை'] = 'கார்த்திகை';
        $data['ரோகிணி'] = 'ரோகிணி';
        $data['மிருகசீரிடம்'] = 'மிருகசீரிடம்';
        $data['திருவாதிரை'] = 'திருவாதிரை';
        $data['புனர்பூசம்'] = 'புனர்பூசம்';
        $data['பூசம்'] = 'பூசம்';
        $data['ஆயில்யம்'] = 'ஆயில்யம்';
        $data['மகம்'] = 'மகம்';
        $data['பூரம்'] = 'பூரம்';
        $data['உத்திரம்'] = 'உத்திரம்';
        $data['அஸ்தம்'] = 'அஸ்தம்';
        $data['சித்திரை'] = 'சித்திரை';
        $data['சுவாதி'] = 'சுவாதி';
        $data['விசாகம்'] = 'விசாகம்';
        $data['அனுசம்'] = 'அனுசம்';
        $data['கேட்டை'] = 'கேட்டை';
        $data['மூலம்'] = 'மூலம்';
        $data['பூராடம்'] = 'பூராடம்';
        $data['உத்திராடம்'] = 'உத்திராடம்';
        $data['திருவோணம்'] = 'திருவோணம்';
        $data['அவிட்டம்'] = 'அவிட்டம்';
        $data['சதயம்'] = 'சதயம்';
        $data['பூரட்டாதி'] = 'பூரட்டாதி';
        $data['உத்திரட்டாதி'] = 'உத்திரட்டாதி';
        $data['ரேவதி'] = 'ரேவதி';

        return $data;
    }
}

if (!function_exists("natchathira_patham_arr")) {
    function natchathira_patham_arr()
    {
        $data = [];

        $data['1-ம் பாதம்'] = '1-ம் பாதம்';
        $data['2-ம் பாதம்'] = '2-ம் பாதம்';
        $data['3-ம் பாதம்'] = '3-ம் பாதம்';
        $data['4-ம் பாதம்'] = '4-ம் பாதம்';

        return $data;
    }
}

if (!function_exists("tamil_zodiac_arr")) {
    function tamil_zodiac_arr()
    {
        $data = [];

        $data['மேஷம்'] = 'மேஷம்';
        $data['ரிஷபம்'] = ' ரிஷபம்';
        $data['மிதுனம்'] = 'மிதுனம்';
        $data['கடகம்'] = 'கடகம்';
        $data['சிம்மம்'] = 'சிம்மம்';
        $data['கன்னி'] = 'கன்னி';
        $data['துலாம்'] = 'துலாம்';
        $data['விருச்சிகம்'] = 'விருச்சிகம்';
        $data['தனுசு'] = 'தனுசு';
        $data['மகரம்'] = 'மகரம்';
        $data['கும்பம்'] = 'கும்பம்';
        $data['மீனம்'] = 'மீனம்';

        return $data;
    }
}

if (!function_exists("planet_arr")) {
    function planet_arr()
    {
        $data = [];

        $data['கேது'] = 'கேது';
        $data['சுக்கிரன்'] = 'சுக்கிரன்';
        $data['சூரியன்'] = 'சூரியன்';
        $data['சந்திரன்'] = 'சந்திரன்';
        $data['செவ்வாய்'] = 'செவ்வாய்';
        $data['ராகு'] = 'ராகு';
        $data['குரு'] = 'குரு';
        $data['சனி'] = 'சனி';
        $data['புதன்'] = 'புதன்';

        return $data;
    }
}


if (!function_exists("tamil_dates_arr")) {
    function tamil_dates_arr()
    {
        $data = [];

        $data['1'] = 1;
        $data['2'] = 2;
        $data['3'] = 3;
        $data['4'] = 4;
        $data['5'] = 5;
        $data['6'] = 6;
        $data['7'] = 7;
        $data['8'] = 8;
        $data['9'] = 9;
        $data['10'] = 10;
        $data['11'] = 11;
        $data['12'] = 12;
        $data['13'] = 13;
        $data['14'] = 14;
        $data['15'] = 15;
        $data['16'] = 16;
        $data['17'] = 17;
        $data['18'] = 18;
        $data['19'] = 19;
        $data['20'] = 20;
        $data['21'] = 21;
        $data['22'] = 22;
        $data['23'] = 23;
        $data['24'] = 24;
        $data['25'] = 25;
        $data['26'] = 26;
        $data['27'] = 27;
        $data['28'] = 28;
        $data['29'] = 29;
        $data['30'] = 30;
        $data['31'] = 31;

        return $data;
    }
}

if (!function_exists("tamil_year_arr")) {
    function tamil_year_arr()
    {
        $data = [];
        
        $data['அட்சய'] = 'அட்சய';
        $data['ஆங்கிரச'] = 'ஆங்கிரச';
        $data['ஆனந்த'] = 'ஆனந்த';
        $data['ஈஸ்வர'] = 'ஈஸ்வர';
        $data['காளயுக்தி'] = 'காளயுக்தி';
        $data['குரோதன'] = 'குரோதன';
        $data['சாதாரண'] = 'சாதாரண';
        $data['சித்தார்த்தி'] = 'சித்தார்த்தி';
        $data['சித்ரபானு'] = 'சித்ரபானு';
        $data['சுக்ல'] = 'சுக்ல';
        $data['சுபானு'] = 'சுபானு';
        $data['தாது'] = 'தாது';
        $data['தாரண'] = 'தாரண';
        $data['துந்துபி'] = 'துந்துபி';
        $data['துன்மதி'] = 'துன்மதி';
        $data['நள'] = 'நள';
        $data['பகுதான்ய'] = 'பகுதான்ய';
        $data['பரிதாபி'] = 'பரிதாபி';
        $data['பவ'] = 'பவ';
        $data['பார்த்திப'] = 'பார்த்திப';
        $data['பிங்கள'] = 'பிங்கள';
        $data['பிரஜோத்பத்தி'] = 'பிரஜோத்பத்தி';
        $data['பிரபவ'] = 'பிரபவ';
        $data['பிரமாதி'] = 'பிரமாதி';
        $data['பிரமாதீச'] = 'பிரமாதீச';
        $data['பிரமோதூத'] = 'பிரமோதூத';
        $data['யுவ'] = 'யுவ';
        $data['ரக்தாட்சி'] = 'ரக்தாட்சி';
        $data['ராட்சச'] = 'ராட்சச';
        $data['ருத்ரோத்காரி'] = 'ருத்ரோத்காரி';
        $data['ரௌத்திரி'] = 'ரௌத்திரி';
        $data['விக்ரம'] = 'விக்ரம';
        $data['விபவ'] = 'விபவ';
        $data['விரோதகிருது'] = 'விரோதகிருது';
        $data['விஷு'] = 'விஷு';
        $data['ஸ்ரீமுக'] = 'ஸ்ரீமுக';

        return $data;
    }
}


/**
 * Drop-down Menu
 *
 * @access	public
 * @param	string
 * @param	array
 * @param	string
 * @param	string
 * @return	string
 */
if (!function_exists('select_dropdown')) {
    function select_dropdown($name = '', $options = array(), $selected = array(), $extra = '', $empty = '------')
    {
        if (!is_array($selected)) {
            $selected = array($selected);
        }

        // If no selected state was submitted we will attempt to set it automatically
        if (count($selected) === 0) {
            // If the form name appears in the $_POST array we have a winner!
            if (isset($_POST[$name])) {
                $selected = array($_POST[$name]);
            }
        }

        if ($extra != '') $extra = ' ' . $extra;

        $multiple = (count($selected) > 1 && strpos($extra, 'multiple') === FALSE) ? ' multiple="multiple"' : '';

        $form = '<select name="' . $name . '"' . $extra . $multiple . ">\n";
        if($empty!=''){
            $form .= '<option value="">' . $empty . "</option>\n";
        }
        

        foreach ($options as $key => $val) {
            $key = (string) $key;

            if (is_array($val) && !empty($val)) {
                $form .= '<optgroup label="' . $key . '">' . "\n";

                foreach ($val as $optgroup_key => $optgroup_val) {
                    $sel = (in_array($optgroup_key, $selected)) ? ' selected="selected"' : '';

                    $form .= '<option value="' . $optgroup_key . '"' . $sel . '>' . (string) $optgroup_val . "</option>\n";
                }

                $form .= '</optgroup>' . "\n";
            } else {
                $sel = (in_array($key, $selected)) ? ' selected="selected"' : '';

                $form .= '<option value="' . $key . '"' . $sel . '>' . (string) $val . "</option>\n";
            }
        }

        $form .= '</select>';

        return $form;
    }
}

if (!function_exists("convert_to_bamini")) {
    function convert_to_bamini($text)
    {
        $bamini['ஃ'] =  '/';
        $bamini['அ'] =  'm';
        $bamini['ஆ'] =  'M';
        $bamini['இ'] =  ',';
        $bamini['ஈ'] =  '<';
        $bamini['உ'] =  'c';
        $bamini['ஊ'] =  'C';
        $bamini['எ'] =  'v';
        $bamini['ஏ'] =  'V';
        $bamini['ஐ'] =  'I';
        $bamini['ஒ'] =  'x';
        $bamini['ஓ'] =  'X';
        $bamini['ஔ'] =  'xs';

        $bamini['க்'] =  'f;';
        $bamini['க'] =  'f';
        $bamini['கா'] =  'fh';
        $bamini['கி'] =  'fp';
        $bamini['கீ'] =  'fP';
        $bamini['கு'] =  'F';
        $bamini['கூ'] =  '$</';
        $bamini['கெ'] =  'nf';
        $bamini['கே'] =  'Nf';
        $bamini['கை'] =  'if';
        $bamini['கொ'] =  'nfh';
        $bamini['கோ'] =  'Nfh';
        $bamini['கௌ'] =  'nfs';

        $bamini['ங்'] = 'q;';
        $bamini['ங'] = 'q';
        $bamini['ஙா'] = 'qh';
        $bamini['ஙெ'] = 'nq';
        $bamini['ஙே'] = 'Nq';
        $bamini['ஙை'] = 'iq';
        $bamini['ஙொ'] = 'nqh';
        $bamini['ஙோ'] = 'Nqh';
        $bamini['ஙௌ'] = 'nqs';


        $bamini['ச்'] = 'r;';
        $bamini['ச'] = 'r';
        $bamini['சா'] = 'rh';
        $bamini['சி'] = 'rp';
        $bamini['சீ'] = 'rP';
        $bamini['சு'] = 'R';
        $bamini['சூ'] = '#';
        $bamini['செ'] = 'nr';
        $bamini['சே'] = 'Nr';
        $bamini['சை'] = 'ir';
        $bamini['சொ'] = 'nrh';
        $bamini['சோ'] = 'Nrh';
        $bamini['சௌ'] = 'nrs';

        $bamini['ஞ்'] = 'Q;';
        $bamini['ஞ'] = 'Q';
        $bamini['ஞா'] = 'Qh';
        $bamini['ஞெ'] = 'nQ';
        $bamini['ஞே'] = 'NQ';
        $bamini['ஞை'] = 'iQ';
        $bamini['ஞொ'] = 'nQh';
        $bamini['ஞோ'] = 'NQh';
        $bamini['ஞௌ'] = 'nQs';

        $bamini['ட்'] = 'l;';
        $bamini['ட'] = 'l';
        $bamini['டா'] = 'lh';
        $bamini['டி'] = 'b';
        $bamini['டீ'] = 'B';
        $bamini['டு'] = 'L';
        $bamini['டூ'] = '^';
        $bamini['டெ'] = 'nl';
        $bamini['டே'] = 'Nl';
        $bamini['டை'] = 'il';
        $bamini['டொ'] = 'nlh';
        $bamini['டோ'] = 'Nlh';
        $bamini['டௌ'] = 'nls';


        $bamini['ண்'] = 'z;';
        $bamini['ண'] = 'z';
        $bamini['ணா'] = 'zh';
        $bamini['ணி'] = 'zp';
        $bamini['ணீ'] = 'zP';
        $bamini['ணு'] = 'Z';
        $bamini['ணூ'] = 'Z}';
        $bamini['ணெ'] = 'nz';
        $bamini['ணே'] = 'Nz';
        $bamini['ணை'] = 'iz';
        $bamini['ணொ'] = 'nzh';
        $bamini['ணோ'] = 'Nzh';
        $bamini['ணௌ'] = 'nzs';

        $bamini['த்'] = 'j;';
        $bamini['த'] = 'j';
        $bamini['தா'] = 'jh';
        $bamini['தி'] = 'jp';
        $bamini['தீ'] = 'jP';
        $bamini['து'] = 'J';
        $bamini['தூ'] = 'J}';
        $bamini['தெ'] = 'nj';
        $bamini['தே'] = 'Nj';
        $bamini['தை'] = 'ij';
        $bamini['தொ'] = 'njh';
        $bamini['தோ'] = 'Njh';
        $bamini['தௌ'] = 'njs';

        $bamini['ந்'] = 'e;';
        $bamini['ந'] = 'e';
        $bamini['நா'] = 'eh';
        $bamini['நி'] = 'ep';
        $bamini['நீ'] = 'eP';
        $bamini['நு'] = 'E';
        $bamini['நூ'] = 'E}';
        $bamini['நெ'] = 'ne';
        $bamini['நே'] = 'Ne';
        $bamini['நை'] = 'ie';
        $bamini['நொ'] = 'neh';
        $bamini['நோ'] = 'Neh';
        $bamini['நௌ'] = 'nes';

        $bamini['ப்'] = 'g;';
        $bamini['ப'] = 'g';
        $bamini['பா'] = 'gh';
        $bamini['பி'] = 'gp';
        $bamini['பீ'] = 'gP';
        $bamini['பு'] = 'G';
        $bamini['பூ'] = 'G+';
        $bamini['பெ'] = 'ng';
        $bamini['பே'] = 'Ng';
        $bamini['பை'] = 'ig';
        $bamini['பொ'] = 'ngh';
        $bamini['போ'] = 'Ngh';
        $bamini['பௌ'] = 'ngs';

        $bamini['ம்'] = 'k;';
        $bamini['ம'] = 'k';
        $bamini['மா'] = 'kh';
        $bamini['மி'] = 'kp';
        $bamini['மீ'] = 'kP';
        $bamini['மு'] = 'K';
        $bamini['மூ'] = '%';
        $bamini['மெ'] = 'nk';
        $bamini['மே'] = 'Nk';
        $bamini['மை'] = 'ik';
        $bamini['மொ'] = 'nkh';
        $bamini['மோ'] = 'Nkh';
        $bamini['மௌ'] = 'nks';


        $bamini['ய்'] = 'a;';
        $bamini['ய'] = 'a';
        $bamini['யா'] = 'ah';
        $bamini['யி'] = 'ap';
        $bamini['யீ'] = 'aP';
        $bamini['யு'] = 'A';
        $bamini['யூ'] = 'A+';
        $bamini['யெ'] = 'na';
        $bamini['யே'] = 'Na';
        $bamini['யை'] = 'ia';
        $bamini['யொ'] = 'nah';
        $bamini['யோ'] = 'Nah';
        $bamini['யௌ'] = 'nas';

        $bamini['ர்'] = 'u;';
        $bamini['ர'] = 'u';
        $bamini['ரா'] = 'uh';
        $bamini['ரி'] = 'up';
        $bamini['ரீ'] = 'uP';
        $bamini['ரு'] = 'U';
        $bamini['ரூ'] = '&';
        $bamini['ரெ'] = 'nu';
        $bamini['ரே'] = 'Nu';
        $bamini['ரை'] = 'iu';
        $bamini['ரொ'] = 'nuh';
        $bamini['ரோ'] = 'Nuh';
        $bamini['ரௌ'] = 'nus';

        $bamini['ல்'] = 'y;';
        $bamini['ல'] = 'y';
        $bamini['லா'] = 'yh';
        $bamini['லி'] = 'yp';
        $bamini['லீ'] = 'yP';
        $bamini['லு'] = 'Y';
        $bamini['லூ'] = 'Y}';
        $bamini['லெ'] = 'ny';
        $bamini['லே'] = 'Ny';
        $bamini['லை'] = 'iy';
        $bamini['லொ'] = 'nyh';
        $bamini['லோ'] = 'Nyh';
        $bamini['லௌ'] = 'nys';


        $bamini['வ்'] = 't;';
        $bamini['வ'] = 't';
        $bamini['வா'] = 'th';
        $bamini['வி'] = 'tp';
        $bamini['வீ'] = 'tP';
        $bamini['வு'] = 'T';
        $bamini['வூ'] = 'T+';
        $bamini['வெ'] = 'nt';
        $bamini['வே'] = 'Nt';
        $bamini['வை'] = 'it';
        $bamini['வொ'] = 'nth';
        $bamini['வோ'] = 'Nth';
        $bamini['வௌ'] = 'nts';

        $bamini['ழ்'] = 'o;';
        $bamini['ழ'] = 'o';
        $bamini['ழா'] = 'oh';
        $bamini['ழி'] = 'op';
        $bamini['ழீ'] = 'oP';
        $bamini['ழு'] = 'O';
        $bamini['ழூ'] = '*';
        $bamini['ழெ'] = 'no';
        $bamini['ழே'] = 'No';
        $bamini['ழை'] = 'io';
        $bamini['ழொ'] = 'noh';
        $bamini['ழோ'] = 'Noh';
        $bamini['ழௌ'] = 'nos';

        $bamini['ள்'] = 's;';
        $bamini['ள'] = 's';
        $bamini['ளா'] = 'sh';
        $bamini['ளி'] = 'sp';
        $bamini['ளீ'] = 'sP';
        $bamini['ளு'] = 'S';
        $bamini['ளூ'] = '@';
        $bamini['ளெ'] = 'ns';
        $bamini['ளே'] = 'Ns';
        $bamini['ளை'] = 'is';
        $bamini['ளொ'] = 'nsh';
        $bamini['ளோ'] = 'Nsh';
        $bamini['ளௌ'] = 'nss';

        $bamini['ற்'] = 'w;';
        $bamini['ற'] = 'w';
        $bamini['றா'] = 'wh';
        $bamini['றி'] = 'wp';
        $bamini['றீ'] = 'wP';
        $bamini['று'] = 'W';
        $bamini['றூ'] = 'W}';
        $bamini['றெ'] = 'nw';
        $bamini['றே'] = 'Nw';
        $bamini['றை'] = 'iw';
        $bamini['றொ'] = 'nwh';
        $bamini['றோ'] = 'Nwh';
        $bamini['றௌ'] = 'nws';

        $bamini['ன்'] = 'd;';
        $bamini['ன'] = 'd';
        $bamini['னா'] = 'dh';
        $bamini['னி'] = 'dp';
        $bamini['னீ'] = 'dP';
        $bamini['னு'] = 'D';
        $bamini['னூ'] = 'D}';
        $bamini['னெ'] = 'nd';
        $bamini['னே'] = 'Nd';
        $bamini['னை'] = 'id';
        $bamini['னொ'] = 'ndh';
        $bamini['னோ'] = 'Ndh';
        $bamini['னௌ'] = 'nds';

        $bamini['ஜ்'] = '[;';
        $bamini['ஜ'] = '[';
        $bamini['ஜா'] = '[h';
        $bamini['ஜி'] = '[p';
        $bamini['ஜீ'] = '[P';
        $bamini['ஜு'] = '[-';
        $bamini['ஜூ'] = '[_';
        $bamini['ஜெ'] = 'n[';
        $bamini['ஜே'] = 'N[';
        $bamini['ஜை'] = 'i[';
        $bamini['ஜொ'] = 'n[h';
        $bamini['ஜோ'] = 'N[h';
        $bamini['ஜௌ'] = 'n[s';

        $bamini["ஷ்"] = "~;";
        $bamini["ஷ"] = '~';
        $bamini["ஷா"] = '~h';
        $bamini["ஷி"] = '~p';
        $bamini["ஷீ"] = '~P';
        $bamini["ஷு"] = '~-';
        $bamini["ஷூ"] = '~_';
        $bamini["ஷெ"] = 'n~';
        $bamini["ஷே"] = 'N~';
        $bamini["ஷை"] = 'i~';
        $bamini["ஷொ"] = 'n~h';
        $bamini["ஷோ"] = 'N~h';
        $bamini["ஷௌ"] = 'n~s';

        $bamini['ஸ்'] = '];';
        $bamini['ஸ'] = ']';
        $bamini['ஸா'] = ']h';
        $bamini['ஸி'] = ']p';
        $bamini['ஸீ'] = ']P';
        $bamini['ஸு'] = ']-';
        $bamini['ஸூ'] = ']_';
        $bamini['ஸெ'] = 'n]';
        $bamini['ஸே'] = 'N]';
        $bamini['ஸை'] = 'i]';
        $bamini['ஸொ'] = 'n]h';
        $bamini['ஸோ'] = 'N]h';
        $bamini['ஸௌ'] = 'n]s';

        $bamini['ஹ்'] = '`;';
        $bamini['ஹ'] = '`';
        $bamini['ஹா'] = '`h';
        $bamini['ஹி'] = '`p';
        $bamini['ஹீ'] = '`P';
        $bamini['ஹு'] = '`-';
        $bamini['ஹூ'] = '`_';
        $bamini['ஹெ'] = 'n`';
        $bamini['ஹே'] = 'N`';
        $bamini['ஹை'] = 'i`';
        $bamini['ஹொ'] = 'n`h';
        $bamini['ஹோ'] = 'N`h';
        $bamini['ஹௌ'] = 'n`s';

        $bamini['க்ஷ்'] = '~;';
        $bamini['க்ஷ'] = '~';
        $bamini['க்ஷா'] = '~h';
        $bamini['க்ஷி'] = '~p';
        $bamini['க்ஷீ'] = '~P';
        $bamini['க்ஷு'] = '~-';
        $bamini['க்ஷூ'] = '~_';
        $bamini['க்ஷெ'] = 'n~';
        $bamini['க்ஷே'] = 'N~';
        $bamini['க்ஷை'] = 'i~';
        $bamini['க்ஷொ'] = 'n~h';
        $bamini['க்ஷோ'] = 'N~h';
        $bamini['க்ஷெள'] = 'n~s';

        $bamini['௸'] = '_';
        $bamini['ஸ்ரீ'] = '=';
        $bamini['oldணா'] = 'zz';
        $bamini['oldனா'] = 'dd';
        $bamini['oldறா'] = 'ww';
        $bamini['oldணை'] = 'izz';
        $bamini['oldனை'] = 'idd';
        $bamini['oldலை'] = 'iyy';
        $bamini['oldளை'] = 'iss';

        $bamini['ா'] = 'h';
        $bamini['ெ'] = 'n';
        $bamini['ே'] = 'N';
        $bamini['ை'] = 'i';

        preg_match_all('/\pL\pM*|./u', $text, $arr_text);

        $tamil_text_arr = [];
        foreach ($arr_text[0] as $value) {
            if (isset($bamini[$value])) {
                $tamil_text_arr[] = $bamini[$value];
            } else {
                $tamil_text_arr[] = '<span style="font-family:times;">' . $value . '</span>';
            }
        }
        return implode("", $tamil_text_arr);
    }

    if (!function_exists("caste_data")) {
        function caste_data($data)
        {
            $caste["Any"] = 'Any';
            $caste["31"] = 'அகமுடையார்';
            $caste["210"] = 'அம்பலக்காரர்';
            $caste["80"] = 'அருந்ததியர்';
            $caste["215"] = 'ஆண்டி பண்டாரம்';
            $caste["63"] = 'ஆதிதிராவிடர்';
            $caste["25"] = 'ஆறுநாட்டு வேளாளர்';
            $caste["94"] = 'ஆள்வார்';
            $caste["84"] = 'இசை வெள்ளாளர்';
            $caste["220"] = 'இந்து கோணார்';
            $caste["96"] = 'இருளர்';
            $caste["17"] = 'இல்லத்து பிள்ளை';
            $caste["97"] = 'எழவர்';
            $caste["89"] = 'ஒக்கலிக கவுண்டர்';
            $caste["10"] = 'கம்மவார் நாயுடு';
            $caste["91"] = 'கருணீகர்';
            $caste["64"] = 'கள்ளர்';
            $caste["9"] = 'கவரா நாயுடு';
            $caste["16"] = 'கவுண்டர்';
            $caste["26"] = 'கவுண்டர்-குரும்பா';
            $caste["15"] = 'கவுண்டர்-கொங்கு வெள்ளாளர்';
            $caste["21"] = 'காரைக்கட்டு பிள்ளை';
            $caste["67"] = 'கார்கார்த்த வேளாளர் சைவம்';
            $caste["98"] = 'கிராமினி';
            $caste["211"] = 'கிருஸ்துவ - படையாட்சி';
            $caste["212"] = 'கிறிஸ்டியன்-RC';
            $caste["216"] = 'கிறிஸ்துவர்';
            $caste["90"] = 'குறவர்';
            $caste["86"] = 'குலலார்';
            $caste["20"] = 'கொடிக்கால் பிள்ளை';
            $caste["2"] = 'சாதி இல்லை';
            $caste["213"] = 'சாத்தாத ஸ்ரீ வைச்ணவா';
            $caste["99"] = 'சாலியர்';
            $caste["32"] = 'செட்டியார்';
            $caste["46"] = 'செட்டியார்-அச்சிரபாக்கம்';
            $caste["38"] = 'செட்டியார்-ஆயிர வைசியர்';
            $caste["37"] = 'செட்டியார்-ஆர்ய வைசியர்';
            $caste["43"] = 'செட்டியார்-கன்னட தேவாங்கர்';
            $caste["42"] = 'செட்டியார்-கன்னடியர்';
            $caste["49"] = 'செட்டியார்-காசுக்காரர்';
            $caste["44"] = 'செட்டியார்-கொங்கு';
            $caste["52"] = 'செட்டியார்-சமயபுரம்';
            $caste["53"] = 'செட்டியார்-சைவம்';
            $caste["35"] = 'செட்டியார்-சோழியர்';
            $caste["219"] = 'செட்டியார்-தெலுங்கு';
            $caste["41"] = 'செட்டியார்-தெலுங்கு தேவாங்கர்';
            $caste["40"] = 'செட்டியார்-தேவாங்கர்';
            $caste["48"] = 'செட்டியார்-நகரம்';
            $caste["50"] = 'செட்டியார்-நடுமண்டலம்';
            $caste["45"] = 'செட்டியார்-நாட்டுகோட்டை';
            $caste["39"] = 'செட்டியார்-பத்மசாலியர்';
            $caste["34"] = 'செட்டியார்-பேரி';
            $caste["47"] = 'செட்டியார்-மஞ்சப்புத்தூர்';
            $caste["51"] = 'செட்டியார்-வடம்பர்';
            $caste["33"] = 'செட்டியார்-வாணியர்';
            $caste["36"] = 'செட்டியார்-வெள்ளான்';
            $caste["24"] = 'சேனை தலைவர்';
            $caste["66"] = 'சைவ பிள்ளை';
            $caste["18"] = 'சோழிய வெள்ளாளர்';
            $caste["92"] = 'சௌராச்டிரா';
            $caste["19"] = 'துளுவ வெள்ளாளர்';
            $caste["95"] = 'தேசிகர்';
            $caste["1"] = 'தேவர்';
            $caste["68"] = 'தேவேந்திரகுலம்';
            $caste["3"] = 'நத்தமான் உடையார்';
            $caste["27"] = 'நாஞ்சில் வெள்ளாளர்';
            $caste["30"] = 'நாடார்';
            $caste["13"] = 'நாயக்கர்';
            $caste["85"] = 'நாயர்';
            $caste["12"] = 'நாயுடு';
            $caste["87"] = 'பர்வத ராஜகுலம்';
            $caste["11"] = 'பலிஜா நாயுடு';
            $caste["22"] = 'பாண்டிய வெள்ளாளர்';
            $caste["82"] = 'பார்க்கவகுலம்';
            $caste["4"] = 'பார்க்குவல மலையமான் உடையார்';
            $caste["70"] = 'பிராமின்-ஐயங்கார்';
            $caste["69"] = 'பிராமின்-ஐயர்';
            $caste["73"] = 'பிராமின்-கன்னட மாத்வா';
            $caste["71"] = 'பிராமின்-குருக்கள்';
            $caste["72"] = 'பிராமின்-தெலுங்கு';
            $caste["28"] = 'பிள்ளை';
            $caste["81"] = 'போயர்';
            $caste["79"] = 'மருத்துவர்';
            $caste["74"] = 'மறவர்';
            $caste["102"] = 'மற்றவை';
            $caste["56"] = 'முதலியார்';
            $caste["58"] = 'முதலியார்-அகமுடையார்';
            $caste["61"] = 'முதலியார்-ஆற்காடு';
            $caste["57"] = 'முதலியார்-செங்குந்தர்';
            $caste["62"] = 'முதலியார்-சைவம்';
            $caste["59"] = 'முதலியார்-துளுவ வேளாளர்';
            $caste["60"] = 'முதலியார்-பூவிருந்தவல்லி';
            $caste["65"] = 'முத்துராஜா';
            $caste["77"] = 'யாதவர்-தமிழ்';
            $caste["78"] = 'யாதவர்-தெலுங்கு';
            $caste["100"] = 'ராஜுக்கள்';
            $caste["217"] = 'ரெட்டியார்';
            $caste["75"] = 'ரெட்டியார்';
            $caste["76"] = 'வண்ணார்';
            $caste["205"] = 'வன்னிய குல சத்ரியர்';
            $caste["14"] = 'வன்னியர் படையாட்சி';
            $caste["101"] = 'வல்லம்பர்';
            $caste["88"] = 'வள்ளுவர்';
            $caste["218"] = 'வாண்டையார்';
            $caste["206"] = 'விஸ்வகர்மா-கம்மாளர்';
            $caste["8"] = 'விஸ்வகர்மா-சைவம்';
            $caste["5"] = 'விஸ்வகர்மா-தமிழ்';
            $caste["6"] = 'விஸ்வகர்மா-தெலுங்கு';
            $caste["208"] = 'விஸ்வகர்மா-பத்தர்';
            $caste["7"] = 'விஸ்வகர்மா-மலையாளம்';
            $caste["83"] = 'வீர சைவம்';
            $caste["23"] = 'வீரக்குடி வெள்ளாளர்';
            $caste["29"] = 'வெள்ளாளர்';
            $caste["93"] = 'வேளார்';
            $caste["207"] = 'வேளாளர்';

            return $caste[$data];
        }
    }
}
